podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_MKE16F16.svd.xml
<!--
Devices using this peripheral: 
      MKE14F16
      MKE16F16
      MKE18F16
-->
      <peripheral>
         <?sourceFile "FTM0_MKE16F16" ?>
         <name>FTM0</name>
         <description>FlexTimer Module</description>
         <groupName>FTM</groupName>
         <headerStructName>FTM0</headerStructName>
         <baseAddress>0x40038000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xA0</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SC</name>
               <description>Status And Control</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Prescale Factor Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Divide by 1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Divide by 2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Divide by 4</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Divide by 8</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Divide by 16</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Divide by 32</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>Divide by 64</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>Divide by 128</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKS</name>
                     <description>Clock Source Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>No clock selected. This in effect disables the FTM counter</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>System clock</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Fixed frequency clock</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External clock</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPWMS</name>
                     <description>Center-Aligned PWM Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FTM counter operates in Up Counting mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FTM counter operates in Up-Down Counting mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RIE</name>
                     <description>Reload Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reload interrupt is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reload interrupt is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RF</name>
                     <description>Reload Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FTM counter did not reach a reload point</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FTM counter reached a reload point</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOIE</name>
                     <description>Timer Overflow Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable TOF interrupts. Use software polling</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable TOF interrupts. An interrupt is generated when TOF equals one</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOF</name>
                     <description>Timer Overflow Flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FTM counter has not overflowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FTM counter has overflowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMEN0</name>
                     <description>Channel 0 PWM enable bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel output port is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel output port is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PWMEN0" > <name>PWMEN1</name> <description>Channel 1 PWM enable bit</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="PWMEN0" > <name>PWMEN2</name> <description>Channel 2 PWM enable bit</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="PWMEN0" > <name>PWMEN3</name> <description>Channel 3 PWM enable bit</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="PWMEN0" > <name>PWMEN4</name> <description>Channel 4 PWM enable bit</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="PWMEN0" > <name>PWMEN5</name> <description>Channel 5 PWM enable bit</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="PWMEN0" > <name>PWMEN6</name> <description>Channel 6 PWM enable bit</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="PWMEN0" > <name>PWMEN7</name> <description>Channel 7 PWM enable bit</description> <bitOffset>23</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <description>Counter</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MOD</name>
               <description>Modulo</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>MOD</name>
                     <description>Modulo Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>8</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>CONTROLS,@pC@i@f</name>
               <addressOffset>0xC</addressOffset>
               <register>
                  <name>CnSC</name>
                  <description>Channel (n) Status And Control</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>DMA</name>
                        <description>DMA Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Disable DMA transfers</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Enable DMA transfers</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ICRST</name>
                        <description>FTM counter reset by the selected input capture event</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>FTM counter is not reset when the selected channel (n) input event is detected</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>FTM counter is reset when the selected channel (n) input event is detected</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ELSA</name>
                        <description>Edge or Level Select</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ELSB</name>
                        <description>Edge or Level Select</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MSA</name>
                        <description>Channel Mode Select</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MSB</name>
                        <description>Channel Mode Select</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CHIE</name>
                        <description>Channel Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Disable channel interrupts. Use software polling</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Enable channel interrupts</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CHF</name>
                        <description>Channel Flag</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>No channel event has occurred</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>A channel event has occurred</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRIGMODE</name>
                        <description>Trigger mode control</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Channel outputs will generate the normal PWM outputs without generating a pulse</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>If a match in the channel occurs, a trigger generation on channel output will happen. The trigger pulse width has one FTM clock cycle</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CHIS</name>
                        <description>Channel Input State</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Channel input pin is at low state</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Channel input pin is at high state</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CnV</name>
                  <description>Channel (n) Value</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>VAL</name>
                        <description>Channel Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>CNTIN</name>
               <description>Counter Initial Value</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>Initial Value Of The FTM Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Capture And Compare Status</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>CH0F</name>
                     <description>Channel 0 Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No channel event has occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A channel event has occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0F" > <name>CH1F</name> <description>Channel 1 Flag</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH2F</name> <description>Channel 2 Flag</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH3F</name> <description>Channel 3 Flag</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH4F</name> <description>Channel 4 Flag</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH5F</name> <description>Channel 5 Flag</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH6F</name> <description>Channel 6 Flag</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH7F</name> <description>Channel 7 Flag</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
