podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_MKE16F16.svd.xml
            <register>
               <name>COMBINE</name>
               <description>Function For Linked Channels</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>COMBINE0</name>
                     <description>Combine Channels For n = 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channels (n) and (n+1) are independent</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channels (n) and (n+1) are combined</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COMP0</name>
                     <description>Complement Of Channel (n) For n = 0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The channel (n+1) output is the same as the channel (n) output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The channel (n+1) output is the complement of the channel (n) output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DECAPEN0</name>
                     <description>Dual Edge Capture Mode Enable For n = 0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The Dual Edge Capture mode in this pair of channels is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The Dual Edge Capture mode in this pair of channels is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DECAP0</name>
                     <description>Dual Edge Capture Mode Captures For n = 0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The dual edge captures are inactive</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The dual edge captures are active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTEN0</name>
                     <description>Deadtime Enable For n = 0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The deadtime insertion in this pair of channels is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The deadtime insertion in this pair of channels is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYNCEN0</name>
                     <description>Synchronization Enable For n = 0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The PWM synchronization in this pair of channels is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The PWM synchronization in this pair of channels is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAULTEN0</name>
                     <description>Fault Control Enable For n = 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The fault control in this pair of channels is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The fault control in this pair of channels is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="COMBINE0" > <name>COMBINE1</name> <description>Combine Channels For n = 2</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="COMP0" > <name>COMP1</name> <description>Complement Of Channel (n) For n = 2</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="DECAPEN0" > <name>DECAPEN1</name> <description>Dual Edge Capture Mode Enable For n = 2</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="DECAP0" > <name>DECAP1</name> <description>Dual Edge Capture Mode Captures For n = 2</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="DTEN0" > <name>DTEN1</name> <description>Deadtime Enable For n = 2</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="SYNCEN0" > <name>SYNCEN1</name> <description>Synchronization Enable For n = 2</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="FAULTEN0" > <name>FAULTEN1</name> <description>Fault Control Enable For n = 2</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="COMBINE0" > <name>COMBINE2</name> <description>Combine Channels For n = 4</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="COMP0" > <name>COMP2</name> <description>Complement Of Channel (n) For n = 4</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="DECAPEN0" > <name>DECAPEN2</name> <description>Dual Edge Capture Mode Enable For n = 4</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="DECAP0" > <name>DECAP2</name> <description>Dual Edge Capture Mode Captures For n = 4</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="DTEN0" > <name>DTEN2</name> <description>Deadtime Enable For n = 4</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="SYNCEN0" > <name>SYNCEN2</name> <description>Synchronization Enable For n = 4</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="FAULTEN0" > <name>FAULTEN2</name> <description>Fault Control Enable For n = 4</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="COMBINE0" > <name>COMBINE3</name> <description>Combine Channels For n = 6</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="COMP0" > <name>COMP3</name> <description>Complement Of Channel (n) for n = 6</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="DECAPEN0" > <name>DECAPEN3</name> <description>Dual Edge Capture Mode Enable For n = 6</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="DECAP0" > <name>DECAP3</name> <description>Dual Edge Capture Mode Captures For n = 6</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="DTEN0" > <name>DTEN3</name> <description>Deadtime Enable For n = 6</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="SYNCEN0" > <name>SYNCEN3</name> <description>Synchronization Enable For n = 6</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="FAULTEN0" > <name>FAULTEN3</name> <description>Fault Control Enable For n = 6</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>DEADTIME</name>
               <description>Deadtime Insertion Control</description>
               <addressOffset>0x68</addressOffset>
               <fields>
                  <field>
                     <name>DTVAL</name>
                     <description>Deadtime Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DTPS</name>
                     <description>Deadtime Prescaler Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x</name>
                           <description>Divide the system clock by 1</description>
                           <value>0b0x</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide the system clock by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Divide the system clock by 16</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTTRIG</name>
               <description>FTM External Trigger</description>
               <addressOffset>0x6C</addressOffset>
               <fields>
                  <field>
                     <name>CH2TRIG</name>
                     <description>Channel 2 Trigger Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The generation of the channel trigger is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The generation of the channel trigger is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH2TRIG" > <name>CH3TRIG</name> <description>Channel 3 Trigger Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH4TRIG</name> <description>Channel 4 Trigger Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH5TRIG</name> <description>Channel 5 Trigger Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH0TRIG</name> <description>Channel 0 Trigger Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH1TRIG</name> <description>Channel 1 Trigger Enable</description> <bitOffset>5</bitOffset> </field>
                  <field>
                     <name>INITTRIGEN</name>
                     <description>Initialization Trigger Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The generation of initialization trigger is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The generation of initialization trigger is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIGF</name>
                     <description>Channel Trigger Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No channel trigger was generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A channel trigger was generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH2TRIG" > <name>CH6TRIG</name> <description>Channel 6 Trigger Enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="CH2TRIG" > <name>CH7TRIG</name> <description>Channel 7 Trigger Enable</description> <bitOffset>9</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>POL</name>
               <description>Channels Polarity</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>POL0</name>
                     <description>Channel 0 Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The channel polarity is active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The channel polarity is active low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="POL0" > <name>POL1</name> <description>Channel 1 Polarity</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL2</name> <description>Channel 2 Polarity</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL3</name> <description>Channel 3 Polarity</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL4</name> <description>Channel 4 Polarity</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL5</name> <description>Channel 5 Polarity</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL6</name> <description>Channel 6 Polarity</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="POL0" > <name>POL7</name> <description>Channel 7 Polarity</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>FMS</name>
               <description>Fault Mode Status</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>FAULTF0</name>
                     <description>Fault Detection Flag 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No fault condition was detected at the fault input</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A fault condition was detected at the fault input</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FAULTF0" > <name>FAULTF1</name> <description>Fault Detection Flag 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FAULTF0" > <name>FAULTF2</name> <description>Fault Detection Flag 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="FAULTF0" > <name>FAULTF3</name> <description>Fault Detection Flag 3</description> <bitOffset>3</bitOffset> </field>
                  <field>
                     <name>FAULTIN</name>
                     <description>Fault Inputs</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The logic OR of the enabled fault inputs is 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The logic OR of the enabled fault inputs is 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write protection is disabled. Write protected bits can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write protection is enabled. Write protected bits cannot be written</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAULTF</name>
                     <description>Fault Detection Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No fault condition was detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A fault condition was detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FILTER</name>
               <description>Input Capture Filter Control</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>CH0FVAL</name>
                     <description>Channel 0 Input Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CH1FVAL</name>
                     <description>Channel 1 Input Filter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CH2FVAL</name>
                     <description>Channel 2 Input Filter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CH3FVAL</name>
                     <description>Channel 3 Input Filter</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
