podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_MKE16F16.svd.xml
            <register>
               <name>SYNCONF</name>
               <description>Synchronization Configuration</description>
               <addressOffset>0x8C</addressOffset>
               <fields>
                  <field>
                     <name>HWTRIGMODE</name>
                     <description>Hardware Trigger Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FTM clears the TRIGj bit when the hardware trigger j is detected, where j = 0, 1,2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FTM does not clear the TRIGj bit when the hardware trigger j is detected, where j = 0, 1,2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNTINC</name>
                     <description>CNTIN Register Synchronization</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>CNTIN register is updated with its buffer value at all rising edges of system clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>CNTIN register is updated with its buffer value by the PWM synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INVC</name>
                     <description>INVCTRL Register Synchronization</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>INVCTRL register is updated with its buffer value at all rising edges of system clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>INVCTRL register is updated with its buffer value by the PWM synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWOC</name>
                     <description>SWOCTRL Register Synchronization</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SWOCTRL register is updated with its buffer value at all rising edges of system clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SWOCTRL register is updated with its buffer value by the PWM synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYNCMODE</name>
                     <description>Synchronization Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Legacy PWM synchronization is selected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enhanced PWM synchronization is selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWRSTCNT</name>
                     <description>FTM counter synchronization is activated by the software trigger</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The software trigger does not activate the FTM counter synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The software trigger activates the FTM counter synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWWRBUF</name>
                     <description>MOD, HCR, CNTIN, and CV registers synchronization is activated by the software trigger</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The software trigger does not activate MOD, HCR, CNTIN, and CV registers synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The software trigger activates MOD, HCR, CNTIN, and CV registers synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWOM</name>
                     <description>Output mask synchronization is activated by the software trigger</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The software trigger does not activate the OUTMASK register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The software trigger activates the OUTMASK register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWINVC</name>
                     <description>Inverting control synchronization is activated by the software trigger</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The software trigger does not activate the INVCTRL register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The software trigger activates the INVCTRL register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWSOC</name>
                     <description>Software output control synchronization is activated by the software trigger</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The software trigger does not activate the SWOCTRL register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The software trigger activates the SWOCTRL register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWRSTCNT</name>
                     <description>FTM counter synchronization is activated by a hardware trigger</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A hardware trigger does not activate the FTM counter synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A hardware trigger activates the FTM counter synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWWRBUF</name>
                     <description>MOD, HCR, CNTIN, and CV registers synchronization is activated by a hardware trigger</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A hardware trigger does not activate MOD, HCR, CNTIN, and CV registers synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A hardware trigger activates MOD, HCR, CNTIN, and CV registers synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWOM</name>
                     <description>Output mask synchronization is activated by a hardware trigger</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A hardware trigger does not activate the OUTMASK register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A hardware trigger activates the OUTMASK register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWINVC</name>
                     <description>Inverting control synchronization is activated by a hardware trigger</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A hardware trigger does not activate the INVCTRL register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A hardware trigger activates the INVCTRL register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWSOC</name>
                     <description>Software output control synchronization is activated by a hardware trigger</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A hardware trigger does not activate the SWOCTRL register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A hardware trigger activates the SWOCTRL register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INVCTRL</name>
               <description>FTM Inverting Control</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>INV0EN</name>
                     <description>Pair Channels 0 Inverting Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Inverting is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Inverting is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="INV0EN" > <name>INV1EN</name> <description>Pair Channels 1 Inverting Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="INV0EN" > <name>INV2EN</name> <description>Pair Channels 2 Inverting Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="INV0EN" > <name>INV3EN</name> <description>Pair Channels 3 Inverting Enable</description> <bitOffset>3</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SWOCTRL</name>
               <description>FTM Software Output Control</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>CH0OC</name>
                     <description>Channel 0 Software Output Control Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The channel output is not affected by software output control</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The channel output is affected by software output control</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0OC" > <name>CH1OC</name> <description>Channel 1 Software Output Control Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH2OC</name> <description>Channel 2 Software Output Control Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH3OC</name> <description>Channel 3 Software Output Control Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH4OC</name> <description>Channel 4 Software Output Control Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH5OC</name> <description>Channel 5 Software Output Control Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH6OC</name> <description>Channel 6 Software Output Control Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH7OC</name> <description>Channel 7 Software Output Control Enable</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>CH0OCV</name>
                     <description>Channel 0 Software Output Control Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The software output control forces 0 to the channel output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The software output control forces 1 to the channel output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0OCV" > <name>CH1OCV</name> <description>Channel 1 Software Output Control Value</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH2OCV</name> <description>Channel 2 Software Output Control Value</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH3OCV</name> <description>Channel 3 Software Output Control Value</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH4OCV</name> <description>Channel 4 Software Output Control Value</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH5OCV</name> <description>Channel 5 Software Output Control Value</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH6OCV</name> <description>Channel 6 Software Output Control Value</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH7OCV</name> <description>Channel 7 Software Output Control Value</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
